In [51]:
import pandas as pd

In [52]:
df = pd.read_csv('categoricalTest.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

#### One hot encoding == dummies

In [53]:
dfOhe = df.copy()

dfOhe = pd.get_dummies(dfOhe, columns = ['Car Model'])
dfOhe

,Mileage,Sell Price($),Age(yrs),Car Model_Audi A5,Car Model_BMW X5,Car Model_Mercedez Benz C class
0,69000,18000,6,0,1,0
1,35000,34000,3,0,1,0
2,57000,26100,5,0,1,0
3,22500,40000,2,0,1,0
4,46000,31500,4,0,1,0
5,59000,29400,5,1,0,0
6,52000,32000,5,1,0,0
7,72000,19300,6,1,0,0
8,91000,12000,8,1,0,0
9,67000,22000,6,0,0,1
10,83000,20000,7,0,0,1
11,79000,21000,7,0,0,1
12,59000,33000,5,0,0,1

##### -----------Check Speed between category datatype and obj--------------------------

In [54]:
# df.dtypes

In [55]:
# df_cat = df.copy()
# df_cat['Car Model'] = df_cat['Car Model'].astype('category')
# df_cat.dtypes

In [56]:
# df_obj = df.copy()
# df_obj.dtypes

In [57]:
# import time
# %timeit df_obj.groupby(['Car Model', 'Mileage']).count()

In [58]:
# %timeit df_cat.groupby(['Car Model', 'Mileage']).count()

###### ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

In [59]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [60]:
x = dfOhe.drop('Sell Price($)', axis = 1)
x

,Mileage,Age(yrs),Car Model_Audi A5,Car Model_BMW X5,Car Model_Mercedez Benz C class
0,69000,6,0,1,0
1,35000,3,0,1,0
2,57000,5,0,1,0
3,22500,2,0,1,0
4,46000,4,0,1,0
5,59000,5,1,0,0
6,52000,5,1,0,0
7,72000,6,1,0,0
8,91000,8,1,0,0
9,67000,6,0,0,1
10,83000,7,0,0,1
11,79000,7,0,0,1
12,59000,5,0,0,1

In [61]:
y = dfOhe['Sell Price($)']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

In [62]:
model.fit(x,y)

LinearRegression()

#### Price of mercedez benz that is 4 yr old with mileage 45000

In [63]:
model.predict([[45000,4,0,0,1]])

array([36991.31721061])

#### Price of BMW X5 that is 7 yr old with mileage 86000

In [64]:
model.predict([[86000,7,0,1,0]])

array([11080.74313219])

In [65]:
model.score(x,y)

0.9417050937281082

### Binary Encoding

In [66]:
import category_encoders as ce
dfBinary = df.copy()
encoder = ce.BinaryEncoder('Car Model')
dfBinary = encoder.fit_transform(dfBinary)
dfBinary

c:\python\python385\lib\site-packages\category_encoders\utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    Car Model_0  Car Model_1  Car Model_2  Mileage  Sell Price($)  Age(yrs)
0             0            0            1    69000          18000         6
1             0            0            1    35000          34000         3
2             0            0            1    57000          26100         5
3             0            0            1    22500          40000         2
4             0            0            1    46000          31500         4
5             0            1            0    59000          29400         5
6             0            1            0    52000          32000         5
7             0            1            0    72000          19300         6
8             0            1            0    91000          12000         8
9             0            1            1    67000          22000         6
10            0            1            1    83000          20000         7
11            0            1            1    79000          21000         7
12            0            1            1    59000          33000         5

In [67]:
X = dfBinary.drop('Sell Price($)', axis = 1)
X

    Car Model_0  Car Model_1  Car Model_2  Mileage  Age(yrs)
0             0            0            1    69000         6
1             0            0            1    35000         3
2             0            0            1    57000         5
3             0            0            1    22500         2
4             0            0            1    46000         4
5             0            1            0    59000         5
6             0            1            0    52000         5
7             0            1            0    72000         6
8             0            1            0    91000         8
9             0            1            1    67000         6
10            0            1            1    83000         7
11            0            1            1    79000         7
12            0            1            1    59000         5

In [68]:
Y = dfBinary['Sell Price($)']
Y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

In [69]:
model.fit(X, Y)

LinearRegression()

In [70]:
model.score(X,Y)

0.9417050937281083

In [71]:
model.predict([[86000,7,0,1,0]])

array([96951.95906309])

#### Age

In [72]:
dummy_df_age = pd.DataFrame({'age': ['0-20', '20-40', '40-60','60-80']})


dummy_df_age.head()

     age
0   0-20
1  20-40
2  40-60
3  60-80

In [73]:
dummy_df_age['start'], dummy_df_age['end'] = zip(*dummy_df_age['age'].map(lambda x: x.split('-')))
dummy_df_age.head()

     age start end
0   0-20     0  20
1  20-40    20  40
2  40-60    40  60
3  60-80    60  80